week_2/branch_bound.tex
% Created 2024-06-16 Sun 22:07
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,left=1cm,right=1cm,top=1cm,bottom=1cm]{geometry}
\usepackage[american]{babel}
\usepackage[sc]{mathpazo}
\linespread{1.05}
\setlength\parindent{0pt}
\author{Marcio Woitek}
\date{}
\title{Branch and Bound Solvers}
\hypersetup{
 pdfauthor={Marcio Woitek},
 pdftitle={Branch and Bound Solvers},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.24)}, 
 pdflang={English}}
\begin{document}

\maketitle
\thispagestyle{empty}
\pagestyle{empty}

\section*{Problem 1}
\label{sec:orgfeda050}
\begin{itemize}
\item If the LP relaxation at the ``root'' of the branch and bound is infeasible, the
whole ILP must be infeasible.
\item Each step of branch and bound solves the LP relaxation of some ILP problem
that is either the original problem or obtained by branching.
\item If the original ILP is unbounded, then the LP relaxation at the root of branch
and bound (the very first LP we will solve) will be unbounded.
\end{itemize}

\section*{Problem 2}
\label{sec:orgbb5143c}
\begin{itemize}
\item We may recursively solve two subproblems with the constraints \(x_1 \leq 2\) and
\(x_1 \geq 3\), respectively.
\item We recursively solve two subproblems with the constraints \(x_4 \leq 6\) and
\(x_4 \geq 7\), respectively.
\end{itemize}

\section*{Problem 3}
\label{sec:orge2d974d}
\begin{itemize}
\item Suppose we solve an LP relaxation and find that the objective value is 8.5, we
can prune this branch from further consideration.
\item Suppose we solve an LP relaxation and find that the objective value is 9.8, we
can prune this branch from further consideration.
\item The optimal solution of the ILP will have objective value greater than or
equal to 9.
\end{itemize}
\end{document}
